<a href="https://colab.research.google.com/github/anicelysantos/book-python-para-analise-de-dados/blob/main/limpeza_preparacao_dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [47]:
import pandas as pd
import numpy as np

# **Tratando dados ausentes**

**NaN** = Não é um número<br>
**NA** = Não avaliável (indisponível)

In [ ]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [ ]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [ ]:
string_data[0] = None

In [ ]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

**Filtrando dados ausentes**

In [ ]:
from numpy import nan as NA

In [ ]:
data = pd.Series([1,NA, 3.5,NA,7])

In [ ]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
#mesma coisa que o anterior
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
#descarta qualquer linha contendo valor ausente
data = pd.DataFrame([[1., 6.5, 3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [ ]:
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [ ]:
#descartar apenas as colunas que contenham NAs
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [ ]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0  0.695373       NaN       NaN
1  0.767821       NaN       NaN
2  1.609004       NaN  0.220196
3 -0.504546       NaN -0.732475
4  0.120819 -1.565330 -0.082433
5 -2.334512  1.806340 -0.900132
6  0.688283 -1.162494 -1.491648

In [ ]:
df.dropna()

          0         1         2
4  0.120819 -1.565330 -0.082433
5 -2.334512  1.806340 -0.900132
6  0.688283 -1.162494 -1.491648

In [ ]:
#deixar somente as linhas que tenham menos de 2 NaN
df.dropna(thresh=2)

          0         1         2
2  1.609004       NaN  0.220196
3 -0.504546       NaN -0.732475
4  0.120819 -1.565330 -0.082433
5 -2.334512  1.806340 -0.900132
6  0.688283 -1.162494 -1.491648

**Preenchendo valores ausentes**

In [ ]:
#passa por parametro o valor a ser preenchido
df.fillna(0)

          0         1         2
0  0.695373  0.000000  0.000000
1  0.767821  0.000000  0.000000
2  1.609004  0.000000  0.220196
3 -0.504546  0.000000 -0.732475
4  0.120819 -1.565330 -0.082433
5 -2.334512  1.806340 -0.900132
6  0.688283 -1.162494 -1.491648

In [ ]:
#preencher com valores diferentes
df.fillna({1:0.5, 2:0})

          0         1         2
0  0.695373  0.500000  0.000000
1  0.767821  0.500000  0.000000
2  1.609004  0.500000  0.220196
3 -0.504546  0.500000 -0.732475
4  0.120819 -1.565330 -0.082433
5 -2.334512  1.806340 -0.900132
6  0.688283 -1.162494 -1.491648

In [ ]:
#modificar o dataframe sem gerar uma cópia
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  0.695373  0.000000  0.000000
1  0.767821  0.000000  0.000000
2  1.609004  0.000000  0.220196
3 -0.504546  0.000000 -0.732475
4  0.120819 -1.565330 -0.082433
5 -2.334512  1.806340 -0.900132
6  0.688283 -1.162494 -1.491648

In [ ]:
df = pd.DataFrame(np.random.randn(6,3))

In [ ]:
df.iloc[2:,1] = NA

In [ ]:
df.iloc[4:,2] = NA

In [ ]:
df

          0         1         2
0  0.848341 -0.396190  0.889161
1  0.684247  0.043599 -2.883327
2  2.595659       NaN  1.677131
3 -0.236061       NaN  0.854327
4  1.456005       NaN       NaN
5 -1.792206       NaN       NaN

In [ ]:
df.fillna(method ='ffill')

          0         1         2
0  0.848341 -0.396190  0.889161
1  0.684247  0.043599 -2.883327
2  2.595659  0.043599  1.677131
3 -0.236061  0.043599  0.854327
4  1.456005  0.043599  0.854327
5 -1.792206  0.043599  0.854327

In [ ]:
#numero máximo de valores a ser preenchido pra frente ou pra trás
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.848341 -0.396190  0.889161
1  0.684247  0.043599 -2.883327
2  2.595659  0.043599  1.677131
3 -0.236061  0.043599  0.854327
4  1.456005       NaN  0.854327
5 -1.792206       NaN  0.854327

In [ ]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# **Transformação de dados**

In [ ]:
data = pd.DataFrame({'k1':['one','two'] * 3 + ['two'],
                     'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [ ]:
#Esse metodo devolve um boolean
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [ ]:
#devolve um dataframe onde o duplicado em false
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [ ]:
data['v1'] = range(7)

In [ ]:
#identificando valores a partir de uma coluna
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [ ]:
#mantem a ultima combinação de valores duplicados ao invés da primeira que aparece
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

**Transformando dados usando uma função ou um mapeamento**

In [ ]:
data = pd.DataFrame({'food': ['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon', 'pastrami','honey ham','nova lox'],
                     'ounces': [4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [ ]:
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [ ]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [ ]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [ ]:
#Uma função fazendo a mesma coisa
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

**Substituindo valores**

In [ ]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [ ]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [ ]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [ ]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [ ]:
data.replace({-999: np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

**Renomeando os índices dos eixos**

In [ ]:
data = pd.DataFrame(np.arange(12).reshape(3,4), index=['Ohio','Colorado','New York'], columns=['one','two','three','four'])

In [ ]:
transform = lambda x: x[:4].upper()

In [ ]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [ ]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [ ]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [ ]:
data.rename(index={'OHIO':'INDIANA'}, columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [ ]:
data.rename(index={'OHIO':'INDIANA'}, columns={'three':'peekaboo'}, inplace=True)
data

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

**Discretização e compartimentalização (binning)**

In [ ]:
ages = [20,22, 25,27,21,23,37,31,61,45,41,32]

In [ ]:
bins = [18,25,35,60,100]

In [ ]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [ ]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [ ]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [ ]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [ ]:
pd.cut(ages, [18,26,36,61,100], right = False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [ ]:
group_names = ['Jovem', 'Jovem adulto', 'Meia idade','Terceira idade']

In [ ]:
pd.cut(ages, bins, labels=group_names)

['Jovem', 'Jovem', 'Jovem', 'Jovem adulto', 'Jovem', ..., 'Jovem adulto', 'Terceira idade', 'Meia idade', 'Meia idade', 'Jovem adulto']
Length: 12
Categories (4, object): ['Jovem' < 'Jovem adulto' < 'Meia idade' < 'Terceira idade']

In [ ]:
data = np.random.rand(20)

In [ ]:
#precision limita a precisão decimal de acordo com o valor do argumento, nesse caso aqui é 2 digitos
pd.cut(data, 4, precision=2)

[(0.5, 0.74], (0.5, 0.74], (0.0071, 0.25], (0.0071, 0.25], (0.25, 0.5], ..., (0.25, 0.5], (0.5, 0.74], (0.5, 0.74], (0.5, 0.74], (0.74, 0.99]]
Length: 20
Categories (4, interval[float64]): [(0.0071, 0.25] < (0.25, 0.5] < (0.5, 0.74] < (0.74, 0.99]]

In [ ]:
data = np.random.randn(1000) #Normalmente distribuidos

In [ ]:
cats = pd.qcut(data, 4) #Separa em quantis
cats

[(-3.179, -0.673], (-3.179, -0.673], (-3.179, -0.673], (0.735, 3.579], (-3.179, -0.673], ..., (-3.179, -0.673], (0.0206, 0.735], (0.0206, 0.735], (0.735, 3.579], (0.0206, 0.735]]
Length: 1000
Categories (4, interval[float64]): [(-3.179, -0.673] < (-0.673, 0.0206] < (0.0206, 0.735] <
                                    (0.735, 3.579]]

In [ ]:
pd.value_counts(cats)

(0.735, 3.579]      250
(0.0206, 0.735]     250
(-0.673, 0.0206]    250
(-3.179, -0.673]    250
dtype: int64

In [ ]:
pd.qcut(data,[0, 0.1, 0.5, 0.9, 1.])

[(-1.207, 0.0206], (-1.207, 0.0206], (-3.179, -1.207], (1.263, 3.579], (-3.179, -1.207], ..., (-1.207, 0.0206], (0.0206, 1.263], (0.0206, 1.263], (1.263, 3.579], (0.0206, 1.263]]
Length: 1000
Categories (4, interval[float64]): [(-3.179, -1.207] < (-1.207, 0.0206] < (0.0206, 1.263] <
                                    (1.263, 3.579]]

**Detectando e filtrando valores discrepantes**

In [ ]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.014372     0.012546     0.013221    -0.001468
std       0.979038     1.003474     1.004417     1.011125
min      -3.194518    -3.889709    -2.936595    -3.155329
25%      -0.667454    -0.645327    -0.670687    -0.655365
50%      -0.022961    -0.032683     0.029464    -0.022404
75%       0.662527     0.658337     0.710523     0.726073
max       2.619890     3.288959     3.200848     2.951847

In [ ]:
#Encontrar valores que excedem 3 na coluna
col =  data[2]
col[np.abs(col) > 3]

886    3.200848
Name: 2, dtype: float64

In [ ]:
#Selecionar todas as linhas que exceda o valor 3 ou -3
data[(np.abs(data) > 3). any(1)]

            0         1         2         3
117 -3.194518  0.686649  0.240275  1.324565
176  0.505560  3.288959 -1.579313  1.055773
209 -0.029916 -1.143328 -1.080277 -3.155329
429 -0.863958 -3.889709 -0.276041  0.635550
743  1.547451 -3.101000 -0.383780 -1.378030
836 -1.122500 -3.035373  0.325446 -0.590685
886 -0.962866  0.566082  3.200848 -1.032252
922  2.169612  3.010049  0.122800  1.808348
931 -3.165009 -1.156416 -1.379186  1.108760
949  0.691143  3.058347 -1.765345 -0.787384

In [ ]:
#Eliminar os valores fora do intervalo -3 e 3
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.014012     0.013215     0.013020    -0.001313
std       0.977906     0.998871     1.003799     1.010652
min      -3.000000    -3.000000    -2.936595    -3.000000
25%      -0.667454    -0.645327    -0.670687    -0.655365
50%      -0.022961    -0.032683     0.029464    -0.022404
75%       0.662527     0.658337     0.710523     0.726073
max       2.619890     3.000000     3.000000     2.951847

In [ ]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0 -1.0
1 -1.0 -1.0  1.0  1.0
2  1.0  1.0 -1.0 -1.0
3  1.0 -1.0 -1.0 -1.0
4  1.0 -1.0 -1.0  1.0

**Permutação e amostragem aleatória**

In [ ]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5,4)))

In [ ]:
sampler = np.random.permutation(5)
sampler

array([1, 0, 2, 3, 4])

In [ ]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [ ]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [ ]:
#trás linhas aleatórias do dataframe, a quantidade pode ser passada por argumento. Nesse exemplo são 3
df.sample(n=3)

   0  1   2   3
2  8  9  10  11
1  4  5   6   7
0  0  1   2   3

In [ ]:
choices = pd.Series([5,7,-1,6,4])

In [ ]:
#Gerar uma amostra com substituição
draws = choices.sample(n=10, replace=True)
draws

3    6
3    6
1    7
4    4
0    5
1    7
0    5
2   -1
4    4
2   -1
dtype: int64

**Calculando variáveis indicadoras/dummy**

In [ ]:
df = pd.DataFrame({'key': ['b','b','a','c','a','b'], 'data': range(6)})

In [ ]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [ ]:
dummie = pd.get_dummies(df['key'], prefix='key')

In [ ]:
df_with_dummy = df[['data']].join(dummie)
df_with_dummy

   data  key_a  key_b  key_c
0     0      0      1      0
1     1      0      1      0
2     2      1      0      0
3     3      0      0      1
4     4      1      0      0
5     5      0      1      0

**Separando muitas informações dentro de uma mesma célula**

In [ ]:
mnames = ['movie_id','title','genres']

In [ ]:
movies = pd.read_table('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/datasets/movielens/movies.dat', sep='::', header=None, names=mnames)

/usr/local/lib/python3.7/dist-packages/pandas/io/parsers.py:767: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  return read_csv(**locals())

In [ ]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [ ]:
all_genres = []

In [ ]:
for x in movies.genres:
  all_genres.extend(x.split('|'))

In [ ]:
genres = pd.unique(all_genres)

In [ ]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [ ]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [ ]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [ ]:
gen = movies.genres[0]

In [ ]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [ ]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [ ]:
for i, gen in enumerate(movies.genres):
  indices = dummies.columns.get_indexer(gen.split('|'))
  dummies.iloc[i, indices] = 1

In [ ]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [ ]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [ ]:
np.random.seed(12345)

In [ ]:
values = np.random.rand(10)

In [ ]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [ ]:
bins=[0, 0.2, 0.4, 0.6, 0.8, 1]

In [ ]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# **Manipulação de strings**

**Métodos de objetos string**

In [ ]:
val = 'a,b, guido'

In [ ]:
val.split(',')

['a', 'b', ' guido']

In [ ]:
pieces = [x.strip() for x in val.split(',')]

In [ ]:
pieces

['a', 'b', 'guido']

In [ ]:
first, second, thrid = pieces

In [ ]:
first + '::' + second + '::' + thrid

'a::b::guido'

In [ ]:
#outro jeito de fazer a mesma coisa
'::'.join(pieces)

'a::b::guido'

In [ ]:
'guido' in val

True

In [ ]:
val.index(',')

1

In [ ]:
val.find(':')

-1

In [ ]:
val.count(',')

2

In [ ]:
val.replace(',','::')

'a::b:: guido'

In [ ]:
val.replace(',','')

'ab guido'

**Expressões regulares**

In [ ]:
import re

Suponha que quiséssemos separar uma string com um número variável de caracteres de espaços em brnco (tabulações, espaços e quebras de linha). A regex que descreve um ou mais caracteres para espaços em branco é `\s+`.

In [ ]:
text = "foo bar\t baz \tqux"

In [ ]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [ ]:
#outro jeito de fazer a mesma coisa
regex = re.compile('\s+')

In [ ]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [ ]:
#findall mostra uma lista de padrões que tem a vê com regex
regex.findall(text)

[' ', '\t ', ' \t']

In [ ]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""

In [ ]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [ ]:
#IGNORECASE faz a regex não diferenciar maiuscula de minuscula
regex = re.compile(pattern, flags=re.IGNORECASE)

In [ ]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [ ]:
m = regex.search(text)
m

In [ ]:
text[m.start():m.end()]

'dave@google.com'

In [ ]:
#Aparece None se o padrão não existir no inicio da string
print(regex.match(text))

None

In [ ]:
#Sub devolve uma nova strig com as ocorrencias do padrão
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

Suponha que quiséssemos encontrar os endereços de email e, simultaneamente, segmentar cada endereço em seus três componentes: nome do usuário, nome do domínio e sufico do domínio.

In [ ]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [ ]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [ ]:
m = regex.match('wesm@bright.net')

In [ ]:
m.groups()

('wesm', 'bright', 'net')

In [ ]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [ ]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

**Funções de string vetorizadas no pandas**

In [ ]:
data = {'Dave': 'dave@google.com', 'Steve':'steve@gmail.com','Rob':'rod@gmail.com','Wes':np.nan}

In [ ]:
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rod@gmail.com
Wes                  NaN
dtype: object

In [ ]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [ ]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [ ]:
pattern

'[A-Z0-9._%+-]+@[A-Z0-9.-]+\\.[A-Z]{2,4}'

In [ ]:
#outro jeito de fazer usando expressões regulares
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [dave@google.com]
Steve    [steve@gmail.com]
Rob        [rod@gmail.com]
Wes                    NaN
dtype: object

In [ ]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [ ]:
#erro do próprio livro. Aguardando correção do autor do livro e criador do Pandas
matches.str.get(1)
matches.str[0]

AttributeError: ignored

In [48]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rod@g
Wes        NaN
dtype: object